Tekla.Structures.AnalysisInternal.DotAnalysisNodeLink.analysisObject
The analysis object.

Tekla.Structures.AnalysisInternal.DotAnalysisNodeLink.coordinateSystem
The coordinate system of the analysis node link.

Tekla.Structures.AnalysisInternal.DotAnalysisNodeLink.startNodeID
The identifier of the start node.

Tekla.Structures.AnalysisInternal.DotAnalysisNodeLink.endNodeID
The identifier of the end node.

Tekla.Structures.AnalysisInternal.DotAnalysisNodeLink.startConnectivity
The start connectivity of the analysis node link.

Tekla.Structures.AnalysisInternal.DotAnalysisNodeLink.endConnectivity
The end connectivity of the analysis node link.

Tekla.Structures.AnalysisInternal.DotAnalysisNodeLink.disabled
This indicates whether the analysis node link is disabled.

Tekla.Structures.AnalysisInternal.DotAnalysisNodeLink.isUserNodeLink
This indicates whether the analysis node is a user node link.

Tekla.Structures.AnalysisInternal.DotAnalysisNodeLink.isUserConnectivity
This indicates whether the analysis node has a user defined support..

Tekla.Structures.AnalysisInternal.DotAnalysisNodeLink.numberOfOwnerPartIDs
The number of owner part identifier.

Tekla.Structures.AnalysisInternal.DotAnalysisNodeLink.ownerPartIDs
The list of identifier of the owner parts.